#include<iostream>
#include<ctime>

int main()
{
    int sum = 0;
    int opcount = 0;
    srand(time(NULL));
    // Задаємо кількість процесорів 
    int a = rand() % 100;
    int processor = a;
    std::cout << "Сores num: " << a << std::endl;
    // У циклі вайл обчислюється кількість операцій які потрібні для співпадіння 1 ядро одна операція,тобто для кі-сті ядер
    // якщо після операції залишились ядра,то ми повторюємо операцію

    while (a > 1)
    {
        //кожен раз число операцій з початку збілшується на 1
        opcount++;
        //виконуємо процедуру підбору процессів для кожного с процессорів, на початку анулюємо змінну що відповідає за процесси
        int proceses = 0;
        for (int i = 0; i < a; i++)
        {
            // b - кількість процесів що випали на долю бідного процесору а;
            int b = rand() % (processor - proceses);
            proceses += b;
            if (b == 1)
                a--;
        }
    }
    //виводимо кільсть операцій що знадобилась для виходу з циклу
    std::cout << "Operation count" << opcount << std::endl;
    return 0;
}