#include<iostream>
#include<ctime>

int main()
{
    int sum = 0;
    int c = 0;
    srand(time(NULL));
    // Задаємо кількість процесорів 
    int a = rand() % 100;
    int A = a;
    std::cout << "Сores num: " << a << std::endl;
    c = 0;
    a = A;
    // У циклі вайл обчислюється кількість операцій які потрібні для співпадіння 1 ядро одна операція,тобто для кі-сті ядер
    // якщо після операції залишились ядра,то ми повторюємо операцію

    while (a > 1)
    {
        //кожен раз число операцій з початку збілшується на 1
        c++;
        for (int i = 0; i < a; i++)
        {
            int processsum = 0;
            // b - кількість процесів що випали на долю бідного процесору а;
            int b = rand() % a;
            processsum += b;
            //Вирішення проблеми того,що кількість процесів повинна бути не більше за кількість процесорів
            if (processsum >= a)
                break;
            if (b == 1)
                a--;
        }
    }
    //виводимо кільсть операцій що знадобилась для виходу з циклу
    std::cout << "Operation count" << c << std::endl;
    return 0;
}